import sys

# Костя подключен к мобильному оператору «Мобайл».
# Абонентская плата Кости составляет A рублей в месяц. 
# За эту стоимость Костя получает B мегабайт интернет-трафика.
# Если Костя выйдет за лимит трафика, то каждый следующий
# мегабайт будет стоить ему C рублей.

# Костя планирует потратить D мегабайт интернет-трафика в следующий месяц.
# Помогите ему сосчитать, во сколько рублей ему обойдется интернет.

# Формат входных данных
# Вводится 4 целых положительных числа 
# A, B, C, D(1 <= A, B, C, D <= 1000) — , 
# A - стоимость тарифа Кости, 
# B - размер тарифа Кости, 
# C - стоимость каждого лишнего мегабайта. 
# D - размер интернет-трафика Кости в следующем месяце

# Числа во входном файле разделены пробелами.

# Формат выходных данных
# Выведите одно натуральное число — суммарные расходы Кости на интернет.

# Замечание
# В первом примере Костя сначала оплатит пакет интернета, после чего потратит на  мегабайт больше, чем разрешено по тарифу. Следовательно, за  мегабайт он дополняет отдельно, получившаяся стоимость  рублей.
# Во втором примере Костя укладывается в тарифный план, поэтому платит только за него.

def main():
    a, b, c, d = map(int, input().split())
    
    additional_cost = 0

    if d > b:
        additional_cost = (d - b) * c

    print(a + additional_cost)
    

if __name__ == '__main__':
    main()