import sys

# Ваня принес на кухню рулет, который он хочет
# разделить с коллегами. Для этого он хочет
# разрезать рулет на N равных частей. 
# Разумеется, рулет можно резать только поперек.
# Соотвественно, Костя сделает N - 1 разрез ножом 
# через равные промежутки.

# По возвращению с кофе-брейка 
# Ваня задумался — а можно ли было обойтись 
# меньшим числом движений, будь нож Вани 
# бесконечно длинным (иначе говоря, если он мог 
# бы сделать сколько угодно разрезов за раз, если 
# эти разрезы лежат на одной прямой)? 
# Считается, что места для разрезов намечены заранее, 
# и все разрезы делаются с ювелирной точностью.

# Оказывается, что можно. Например, если Ваня 
# хотел бы разделить рулет на  части, он мог 
# бы обойтись двумя разрезами — сначала он 
# разделил бы рулет на две половинки, а потом 
# совместил бы две половинки и разрезал обе 
# пополам одновременно.
# Вам дано число , требуется сказать, каким
# минимальным числом разрезов можно обойтись.

# Формат входных данных
# Дано одно натуральное число  — количество людей на кофе-брйке.

# Формат выходных данных
# Выведите одно число — минимальное число движений, которое придется сделать Косте.

# Замечание
# Чтобы разрезать рулет на  частей, Ване сначала придется разрезать его на две равные части, после чего совместить две половинки и сделать два разреза.
# Чтобы разрезать рулет на  частей, Ване понадобится разделить его в соотношении , после чего совместить два рулета по левому краю и разрезать бОльший рулет на одинарные кусочки — меньший тоже разделится на одинарные.

def main():
    a = int(input())
    counter = 0

    while a > 1:
        if a % 2 == 0:
            a //= 2 
        else:
            a -= 1
        counter += 1

    print(counter)
    
    

if __name__ == '__main__':
    main()