import sys

# Подготовка задач к сезону это долгий и кропотливый процесс. Юля знает, что уже готово 
# A задач. Никита выяснил, что ещё B задач почти готовы и в ближайшее время будут добавлены в сезон.
# Помогите Юле и Никите узнать, сколько всего задач планируется в сезоне.

# Формат ввода
# Первая строка содержит два числа A и B 
# (0 ≤ A, B ≤ 2 * 10^18) разделенные пробелом

# Формат вывода
# Выведите одно число - количество задач, которые будут в сезоне.

def main():
    print(sum(map(int, input().split())))


if __name__ == '__main__':
    main()