import sys

# Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами?
# Если это возможно, выведите строку YES, иначе выведите строку NO.
# Треугольник — это три точки, не лежащие на одной прямой.

# Формат ввода
# - Вводятся три натуральных числа.

# Формат вывода
# - Выведите ответ на задачу.

def main():
    a, b, c = int(input()), int(input()), int(input())
    tr_stat = (a + b > c) and (a + c > b) and (b + c > a)
    if tr_stat:
        print('YES')
    else:
        print('NO')

if __name__ == '__main__':
    main()